{
  "prepaidPack": [
    {
      "internationalPack": [
        {
          "irPack": [
            {
              "packInstructions": "International roaming notes - The pack benefits are applicable only on the preferred partner network in the visited country, if any other partner is chosen then standard rates will be applicable. Please restart your handset 15 mins after purchasing the pack. Value packs without WiFi calling - Value pack ₹1101 - Applicable for 100+ countries. Value pack ₹1201 - Applicable for 169 countries. Incoming calls on Wi-Fi calling can be received from anywhere in the world at ₹1. Outgoing calls over Wi-Fi calling are not allowed. Value packs with WiFi calling - Value pack ₹1102 - Applicable for 100+ countries. Value pack ₹1202 - Applicable for 169 countries. Wi-Fi calling facility is allowed only for call back to India. Incoming calls on Wi-Fi calling can be received from anywhere in the world at ₹1. Outgoing SMS over Wi-Fi calling is not allowed. All incoming text messages will be delivered without any charge. Voice calling through Wi-Fi calling will be charged at ₹1 per minute to India. Video calls through Wi-Fi calling can be made on a Jio number only. You will be charged at ₹1 per minute plus the data deduction will happen from the data balance available in your base plan (The actual data usage of your video call may vary). For IR 1202 pack iPhone users, Wi-Fi calling facility is available in limited countries. Unlimited packs without WiFi calling - Applicable for 22 countries. Incoming calls from anywhere in the world by enabling Wi-Fi calling feature will be free. Outgoing calls over Wi-Fi calling are not allowed.",
              "packDetails": [
                {
                  "countryName": "Afghanistan",
                  "limitedIRPack": [
                    {
                      "withWifi": {
                        "packName": "Value Pack with Wifi calling",
                        "packPrice": 1102,
                        "packValidity": 28,
                        "talktimeCost": 933.9,
                        "smsCost": 5
                      },
                      "withoutWifi": {
                        "packName": "Value Pack without Wifi calling",
                        "packPrice": 1101,
                        "packValidity": 28,
                        "talktimeCost": 933.05,
                        "smsCost": 5
                      }
                    }
                  ]
                },
                {
                  "countryName": "Algeria",
                  "limitedIRPack": [
                    {
                      "withWifi": {
                        "packName": "Value Pack with Wifi calling",
                        "packPrice": 1202,
                        "packValidity": 28,
                        "talktimeCost": 1018.64,
                        "smsCost": 5
                      },
                      "withoutWifi": {
                        "packName": "Value Pack without Wifi calling",
                        "packPrice": 1201,
                        "packValidity": 28,
                        "talktimeCost": 1017.8,
                        "smsCost": 5
                      }
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
